# Transforming DataFrames

In [1]:
import pandas as pd

### Importando/Carregando o Dataset Para o Pandas

In [100]:
pokemon = pd.read_csv("./datasets/pokemon/pokemon_data.csv")
gas = pd.read_csv("./datasets/gas_prices_brazil_2004-2021.csv")
# pokemon_xlsx = pd.read_excel("./datasets/pokemon_data.xlsx")
# pokemon_txt = pd.read_csv("./datasets/pokemon_data.txt", delimeter="\t")

,DATA INICIAL,DATA FINAL,REGIÃO,ESTADO,PRODUTO,NÚMERO DE POSTOS PESQUISADOS,UNIDADE DE MEDIDA,PREÇO MÉDIO REVENDA,DESVIO PADRÃO REVENDA,PREÇO MÍNIMO REVENDA,PREÇO MÁXIMO REVENDA,MARGEM MÉDIA REVENDA,COEF DE VARIAÇÃO REVENDA,PREÇO MÉDIO DISTRIBUIÇÃO,DESVIO PADRÃO DISTRIBUIÇÃO,PREÇO MÍNIMO DISTRIBUIÇÃO,PREÇO MÁXIMO DISTRIBUIÇÃO,COEF DE VARIAÇÃO DISTRIBUIÇÃO
0,09/05/2004,15/05/2004,CENTRO OESTE,DISTRITO FEDERAL,ETANOL HIDRATADO,127,R$/l,1.288,0.016,1.190,1.350,0.463,0.012,0.825,0.11,0.4201,0.9666,0.133
1,09/05/2004,15/05/2004,CENTRO OESTE,GOIAS,ETANOL HIDRATADO,387,R$/l,1.162,0.114,0.890,1.449,0.399,0.098,0.763,0.088,0.5013,1.05,0.115
2,09/05/2004,15/05/2004,CENTRO OESTE,MATO GROSSO,ETANOL HIDRATADO,192,R$/l,1.389,0.097,1.180,1.760,0.419,0.070,0.97,0.095,0.5614,1.161,0.098
3,09/05/2004,15/05/2004,CENTRO OESTE,MATO GROSSO DO SUL,ETANOL HIDRATADO,162,R$/l,1.262,0.070,1.090,1.509,0.432,0.055,0.83,0.119,0.5991,1.22242,0.143
4,09/05/2004,15/05/2004,NORDESTE,ALAGOAS,ETANOL HIDRATADO,103,R$/l,1.181,0.078,1.050,1.400,0.24,0.066,0.941,0.077,0.7441,1.0317,0.082
5,09/05/2004,15/05/2004,NORDESTE,BAHIA,ETANOL HIDRATADO,408,R$/l,1.383,0.132,0.999,2.050,0.426,0.095,0.957,0.128,0.5686,1.35,0.134
6,09/05/2004,15/05/2004,NORDESTE,CEARA,ETANOL HIDRATADO,278,R$/l,1.453,0.218,1.030,1.950,0.353,0.150,1.1,0.068,0.7332,1.294,0.062
7,09/05/2004,15/05/2004,NORDESTE,MARANHAO,ETANOL HIDRATADO,105,R$/l,1.631,0.158,1.350,2.000,0.515,0.097,1.116,0.091,0.9923,1.36183,0.082
8,09/05/2004,15/05/2004,NORDESTE,PARAIBA,ETANOL HIDRATADO,125,R$/l,1.284,0.130,1.100,1.699,0.353,0.101,0.931,0.072,0.7577,1.2972,0.077
9,09/05/2004,15/05/2004,NORDESTE,PERNAMBUCO,ETANOL HIDRATADO,423,R$/l,1.224,0.141,0.989,1.700,0.277,0.115,0.947,0.091,0.5643,1.3541,0.096

### Acessando Informações do DataFrame e Elementos Chave

#### Informações Gerais Sobre o Dataset

In [ ]:
pokemon.info()
gas.info()

#### DataFrame

No pandas, o objeto que representa o dataset carregado é chamado de Data Frame<br>

É uma tabela bi-dimensional, de tamanho mutável, com dados parcialmente heterogêneos

In [27]:
type(gas)

pandas.core.frame.DataFrame

Podemos acessar as dimensões do DataFrame utilizando o aributo .shape do Data Frame

In [28]:
gas.shape

(120823, 18)

##### Criando um DataFrame

A forma mais comum é importar um DataFrame, porém também é possível criar um a partir de um dicionário.<br>

As chaves representam as colunas e cada valor da lista representam as linhas

In [39]:
star_wars_dict = {
    "name": ["Luke Skywalker", "Yoda", "Palpatine"],
    "age": [16, 1000, 70],
    "weight_kg": [70, 15, 60],
    "is_jedi": [True, True, False]
}

star_wars = pd.DataFrame(star_wars_dict)
star_wars

             name   age  weight_kg  is_jedi
0  Luke Skywalker    16         70     True
1            Yoda  1000         15     True
2       Palpatine    70         60    False

##### Colunas

In [32]:
star_wars.columns

Index(['nome', 'age', 'weight_kg', 'is_jedi'], dtype='object')

In [34]:
type(star_wars.columns)

pandas.core.indexes.base.Index

In [35]:
list(star_wars.columns)

['nome', 'age', 'weight_kg', 'is_jedi']

Para renomear colunas do DataFrame, utilize o metodo rename, pode retornar uma cópia ou alterar o original

In [44]:
cpsw = star_wars.rename(columns={
    "name": "full name"
}, inplace=True)

In [45]:
star_wars

        full name   age  weight_kg  is_jedi
0  Luke Skywalker    16         70     True
1            Yoda  1000         15     True
2       Palpatine    70         60    False

#### Series

Array uni-dimensional com os dados e rótulos de um eixo (linha ou coluna)

In [49]:
gas.head()

,DATA INICIAL,DATA FINAL,REGIÃO,ESTADO,PRODUTO,NÚMERO DE POSTOS PESQUISADOS,UNIDADE DE MEDIDA,PREÇO MÉDIO REVENDA,DESVIO PADRÃO REVENDA,PREÇO MÍNIMO REVENDA,PREÇO MÁXIMO REVENDA,MARGEM MÉDIA REVENDA,COEF DE VARIAÇÃO REVENDA,PREÇO MÉDIO DISTRIBUIÇÃO,DESVIO PADRÃO DISTRIBUIÇÃO,PREÇO MÍNIMO DISTRIBUIÇÃO,PREÇO MÁXIMO DISTRIBUIÇÃO,COEF DE VARIAÇÃO DISTRIBUIÇÃO
0,09/05/2004,15/05/2004,CENTRO OESTE,DISTRITO FEDERAL,ETANOL HIDRATADO,127,R$/l,1.288,0.016,1.19,1.350,0.463,0.012,0.825,0.11,0.4201,0.9666,0.133
1,09/05/2004,15/05/2004,CENTRO OESTE,GOIAS,ETANOL HIDRATADO,387,R$/l,1.162,0.114,0.89,1.449,0.399,0.098,0.763,0.088,0.5013,1.05,0.115
2,09/05/2004,15/05/2004,CENTRO OESTE,MATO GROSSO,ETANOL HIDRATADO,192,R$/l,1.389,0.097,1.18,1.760,0.419,0.070,0.97,0.095,0.5614,1.161,0.098
3,09/05/2004,15/05/2004,CENTRO OESTE,MATO GROSSO DO SUL,ETANOL HIDRATADO,162,R$/l,1.262,0.070,1.09,1.509,0.432,0.055,0.83,0.119,0.5991,1.22242,0.143
4,09/05/2004,15/05/2004,NORDESTE,ALAGOAS,ETANOL HIDRATADO,103,R$/l,1.181,0.078,1.05,1.400,0.24,0.066,0.941,0.077,0.7441,1.0317,0.082

In [65]:
# Selecionando uma coluna inteira
# A series retornada é uma REFERÊNCIA ao DataFrame (Não é uma cópia)

gas["ESTADO"]

0           DISTRITO FEDERAL
1                      GOIAS
2                MATO GROSSO
3         MATO GROSSO DO SUL
4                    ALAGOAS
                 ...
120818               RORAIMA
120819        SANTA CATARINA
120820             SAO PAULO
120821               SERGIPE
120822             TOCANTINS
Name: ESTADO, Length: 120823, dtype: object

In [54]:
# Selecionando uma coluna inteira
# Esta forma só funciona para colunas sem espaços (ou qualquer outro caractere invalido)

gas.ESTADO

0           DISTRITO FEDERAL
1                      GOIAS
2                MATO GROSSO
3         MATO GROSSO DO SUL
4                    ALAGOAS
                 ...
120818               RORAIMA
120819        SANTA CATARINA
120820             SAO PAULO
120821               SERGIPE
120822             TOCANTINS
Name: ESTADO, Length: 120823, dtype: object

In [56]:
type(gas["ESTADO"])

pandas.core.series.Series

In [58]:
# Selecionando a observação indexada no index 1 do DataFrame

gas.iloc[1]

DATA INICIAL                           09/05/2004
DATA FINAL                             15/05/2004
REGIÃO                               CENTRO OESTE
ESTADO                                      GOIAS
PRODUTO                          ETANOL HIDRATADO
NÚMERO DE POSTOS PESQUISADOS                  387
UNIDADE DE MEDIDA                            R$/l
PREÇO MÉDIO REVENDA                         1.162
DESVIO PADRÃO REVENDA                       0.114
PREÇO MÍNIMO REVENDA                         0.89
PREÇO MÁXIMO REVENDA                        1.449
MARGEM MÉDIA REVENDA                        0.399
COEF DE VARIAÇÃO REVENDA                    0.098
PREÇO MÉDIO DISTRIBUIÇÃO                    0.763
DESVIO PADRÃO DISTRIBUIÇÃO                  0.088
PREÇO MÍNIMO DISTRIBUIÇÃO                  0.5013
PREÇO MÁXIMO DISTRIBUIÇÃO                    1.05
COEF DE VARIAÇÃO DISTRIBUIÇÃO               0.115
Name: 1, dtype: object

In [59]:
type(gas.iloc[1])

pandas.core.series.Series

##### Criando uma Series

In [61]:
pd.Series([5.5, 6.0, 12])

0     5.5
1     6.0
2    12.0
dtype: float64

#### Atribuindo Dados

##### Atribuindo constantes

In [101]:
produto_view = gas["PRODUTO"]
produto_view

0         ETANOL HIDRATADO
1         ETANOL HIDRATADO
2         ETANOL HIDRATADO
3         ETANOL HIDRATADO
4         ETANOL HIDRATADO
                ...
120818     OLEO DIESEL S10
120819     OLEO DIESEL S10
120820     OLEO DIESEL S10
120821     OLEO DIESEL S10
120822     OLEO DIESEL S10
Name: PRODUTO, Length: 120823, dtype: object

In [102]:
produto_copy = gas["PRODUTO"].copy()
produto_copy

0         ETANOL HIDRATADO
1         ETANOL HIDRATADO
2         ETANOL HIDRATADO
3         ETANOL HIDRATADO
4         ETANOL HIDRATADO
                ...
120818     OLEO DIESEL S10
120819     OLEO DIESEL S10
120820     OLEO DIESEL S10
120821     OLEO DIESEL S10
120822     OLEO DIESEL S10
Name: PRODUTO, Length: 120823, dtype: object

In [110]:
# gas["PRODUTO"] = "Combustível"

'Combustível'

##### Atribuindo listas ou series

In [104]:
nrows, ncols = gas.shape
novos_produtos = [f"Produto {i}" for i in range(nrows)]
len(novos_produtos)

In [ ]:
# gas["PRODUTO"] = novos_produtos

##### Criando novas colunas

In [114]:
# Valor constante

gas["COLUNA NOVA"] = "DEFAULT"

In [116]:
# A partir de uma lista

gas["COLUNA A PARTIR DE LISTA"] = range(gas.shape[0])

In [119]:
# Derivado de outras colunas

gas["VALOR DERIVADO DE OUTRAS COLUNAS"] = gas["PREÇO MÉDIO REVENDA"] * 6.0

In [120]:
gas.head()

,DATA INICIAL,DATA FINAL,REGIÃO,ESTADO,PRODUTO,NÚMERO DE POSTOS PESQUISADOS,UNIDADE DE MEDIDA,PREÇO MÉDIO REVENDA,DESVIO PADRÃO REVENDA,PREÇO MÍNIMO REVENDA,...,COEF DE VARIAÇÃO REVENDA,PREÇO MÉDIO DISTRIBUIÇÃO,DESVIO PADRÃO DISTRIBUIÇÃO,PREÇO MÍNIMO DISTRIBUIÇÃO,PREÇO MÁXIMO DISTRIBUIÇÃO,COEF DE VARIAÇÃO DISTRIBUIÇÃO,coluna nova,COLUNA NOVA,COLUNA A PARTIR DE LISTA,VALOR DERIVADO DE OUTRAS COLUNAS
0,09/05/2004,15/05/2004,CENTRO OESTE,DISTRITO FEDERAL,ETANOL HIDRATADO,127,R$/l,1.288,0.016,1.19,...,0.012,0.825,0.11,0.4201,0.9666,0.133,DEFAULT,DEFAULT,0,7.728
1,09/05/2004,15/05/2004,CENTRO OESTE,GOIAS,ETANOL HIDRATADO,387,R$/l,1.162,0.114,0.89,...,0.098,0.763,0.088,0.5013,1.05,0.115,DEFAULT,DEFAULT,1,6.972
2,09/05/2004,15/05/2004,CENTRO OESTE,MATO GROSSO,ETANOL HIDRATADO,192,R$/l,1.389,0.097,1.18,...,0.070,0.97,0.095,0.5614,1.161,0.098,DEFAULT,DEFAULT,2,8.334
3,09/05/2004,15/05/2004,CENTRO OESTE,MATO GROSSO DO SUL,ETANOL HIDRATADO,162,R$/l,1.262,0.070,1.09,...,0.055,0.83,0.119,0.5991,1.22242,0.143,DEFAULT,DEFAULT,3,7.572
4,09/05/2004,15/05/2004,NORDESTE,ALAGOAS,ETANOL HIDRATADO,103,R$/l,1.181,0.078,1.05,...,0.066,0.941,0.077,0.7441,1.0317,0.082,DEFAULT,DEFAULT,4,7.086

##### Index

In [123]:
gas.index

RangeIndex(start=0, stop=120823, step=1)

In [124]:
pesquisa_de_satisfacao = pd.DataFrame({
    "bom": [50, 21, 100],
    "ruim": [131, 2, 30],
    "pessimo": [30, 20, 1]
}, index=["Xbox", "PS5", "Switch"])

In [125]:
pesquisa_de_satisfacao

        bom  ruim  pessimo
Xbox     50   131       30
PS5      21     2       20
Switch  100    30        1

In [ ]:
###

In [67]:
dogs_df.head()

      name      breed  color  height_cm  weight_kg date_of_birth
0    Bella   Labrador  Brown         56         24    2013-07-01
1  Charlie     Poodle  Black         43         24    2016-09-16
2     Lucy  Chow Chow  Brown         46         24    2014-08-25
3   Cooper  Schnauzer   Gray         49         17    2011-12-11
4      Max   Labrador  Black         59         29    2017-01-20

In [68]:
dogs_df.head(2)

      name     breed  color  height_cm  weight_kg date_of_birth
0    Bella  Labrador  Brown         56         24    2013-07-01
1  Charlie    Poodle  Black         43         24    2016-09-16

In [69]:
dogs_df.tail()

     name        breed  color  height_cm  weight_kg date_of_birth
2    Lucy    Chow Chow  Brown         46         24    2014-08-25
3  Cooper    Schnauzer   Gray         49         17    2011-12-11
4     Max     Labrador  Black         59         29    2017-01-20
5  Stella    Chihuahua    Tan         18          2    2015-04-20
6  Bernie  St. Bernard  White         77         74    2018-02-27

In [70]:
dogs_df.tail(2)

     name        breed  color  height_cm  weight_kg date_of_birth
5  Stella    Chihuahua    Tan         18          2    2015-04-20
6  Bernie  St. Bernard  White         77         74    2018-02-27

In [71]:
dogs_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           7 non-null      object
 1   breed          7 non-null      object
 2   color          7 non-null      object
 3   height_cm      7 non-null      int64
 4   weight_kg      7 non-null      int64
 5   date_of_birth  7 non-null      object
dtypes: int64(2), object(4)
memory usage: 464.0+ bytes

In [72]:
dogs_df.shape

(7, 6)

In [73]:
dogs_df.describe()

       height_cm  weight_kg
count   7.000000   7.000000
mean   49.714286  27.714286
std    17.960274  22.216468
min    18.000000   2.000000
25%    44.500000  20.500000
50%    49.000000  24.000000
75%    57.500000  26.500000
max    77.000000  74.000000

dogs_df.values

In [75]:
dogs_df.columns

Index(['name', 'breed', 'color', 'height_cm', 'weight_kg', 'date_of_birth'], dtype='object')

In [76]:
dogs_df.index

RangeIndex(start=0, stop=7, step=1)

### Sorting and Subsetting

#### Sorting

In [77]:
dogs_df.sort_values("weight_kg")

      name        breed  color  height_cm  weight_kg date_of_birth
5   Stella    Chihuahua    Tan         18          2    2015-04-20
3   Cooper    Schnauzer   Gray         49         17    2011-12-11
0    Bella     Labrador  Brown         56         24    2013-07-01
1  Charlie       Poodle  Black         43         24    2016-09-16
2     Lucy    Chow Chow  Brown         46         24    2014-08-25
4      Max     Labrador  Black         59         29    2017-01-20
6   Bernie  St. Bernard  White         77         74    2018-02-27

In [78]:
dogs_df.sort_values("weight_kg", ascending=False)

      name        breed  color  height_cm  weight_kg date_of_birth
6   Bernie  St. Bernard  White         77         74    2018-02-27
4      Max     Labrador  Black         59         29    2017-01-20
0    Bella     Labrador  Brown         56         24    2013-07-01
1  Charlie       Poodle  Black         43         24    2016-09-16
2     Lucy    Chow Chow  Brown         46         24    2014-08-25
3   Cooper    Schnauzer   Gray         49         17    2011-12-11
5   Stella    Chihuahua    Tan         18          2    2015-04-20

In [79]:
dogs_df.sort_values(["weight_kg", "height_cm"])

      name        breed  color  height_cm  weight_kg date_of_birth
5   Stella    Chihuahua    Tan         18          2    2015-04-20
3   Cooper    Schnauzer   Gray         49         17    2011-12-11
1  Charlie       Poodle  Black         43         24    2016-09-16
2     Lucy    Chow Chow  Brown         46         24    2014-08-25
0    Bella     Labrador  Brown         56         24    2013-07-01
4      Max     Labrador  Black         59         29    2017-01-20
6   Bernie  St. Bernard  White         77         74    2018-02-27

In [80]:
dogs_df.sort_values(["weight_kg", "height_cm"], ascending=[True, False])

      name        breed  color  height_cm  weight_kg date_of_birth
5   Stella    Chihuahua    Tan         18          2    2015-04-20
3   Cooper    Schnauzer   Gray         49         17    2011-12-11
0    Bella     Labrador  Brown         56         24    2013-07-01
2     Lucy    Chow Chow  Brown         46         24    2014-08-25
1  Charlie       Poodle  Black         43         24    2016-09-16
4      Max     Labrador  Black         59         29    2017-01-20
6   Bernie  St. Bernard  White         77         74    2018-02-27

#### Subsetting Columns

In [81]:
dogs_df["name"]

0      Bella
1    Charlie
2       Lucy
3     Cooper
4        Max
5     Stella
6     Bernie
Name: name, dtype: object

In [82]:
cols_to_subset = ["breed", "height_cm"]
dogs_df[cols_to_subset]

         breed  height_cm
0     Labrador         56
1       Poodle         43
2    Chow Chow         46
3    Schnauzer         49
4     Labrador         59
5    Chihuahua         18
6  St. Bernard         77

#### Subsetting Rows

In [83]:
dogs_df["height_cm"] > 50

0     True
1    False
2    False
3    False
4     True
5    False
6     True
Name: height_cm, dtype: bool

In [84]:
bigger_dogs = dogs_df["height_cm"] > 50

dogs_df[bigger_dogs]

     name        breed  color  height_cm  weight_kg date_of_birth
0   Bella     Labrador  Brown         56         24    2013-07-01
4     Max     Labrador  Black         59         29    2017-01-20
6  Bernie  St. Bernard  White         77         74    2018-02-27

In [85]:
labrador_dogs = dogs_df["breed"] == "Labrador"
dogs_df[labrador_dogs]

    name     breed  color  height_cm  weight_kg date_of_birth
0  Bella  Labrador  Brown         56         24    2013-07-01
4    Max  Labrador  Black         59         29    2017-01-20

In [86]:
youngest_dogs = dogs_df["date_of_birth"] < "2015-01-01"
dogs_df[youngest_dogs]

     name      breed  color  height_cm  weight_kg date_of_birth
0   Bella   Labrador  Brown         56         24    2013-07-01
2    Lucy  Chow Chow  Brown         46         24    2014-08-25
3  Cooper  Schnauzer   Gray         49         17    2011-12-11

In [87]:
is_lab = dogs_df["breed"] == "Labrador"
is_brown = dogs_df["color"] == "Brown"
dogs_df[is_lab & is_brown]

    name     breed  color  height_cm  weight_kg date_of_birth
0  Bella  Labrador  Brown         56         24    2013-07-01

In [88]:
is_black_or_brown = dogs_df["color"].isin(["Black", "Brown"])
dogs_df[is_black_or_brown]

      name      breed  color  height_cm  weight_kg date_of_birth
0    Bella   Labrador  Brown         56         24    2013-07-01
1  Charlie     Poodle  Black         43         24    2016-09-16
2     Lucy  Chow Chow  Brown         46         24    2014-08-25
4      Max   Labrador  Black         59         29    2017-01-20

### New Columns

#### Add a new Column

In [90]:
dogs_df["height_m"] = dogs_df["height_cm"] / 100
dogs_df

      name        breed  color  height_cm  weight_kg date_of_birth  height_m
0    Bella     Labrador  Brown         56         24    2013-07-01      0.56
1  Charlie       Poodle  Black         43         24    2016-09-16      0.43
2     Lucy    Chow Chow  Brown         46         24    2014-08-25      0.46
3   Cooper    Schnauzer   Gray         49         17    2011-12-11      0.49
4      Max     Labrador  Black         59         29    2017-01-20      0.59
5   Stella    Chihuahua    Tan         18          2    2015-04-20      0.18
6   Bernie  St. Bernard  White         77         74    2018-02-27      0.77

In [92]:
dogs_df["bmi"] = dogs["weight_kg"] / dogs_df["height_m"] ** 2
dogs_df

,name,breed,color,height_cm,weight_kg,date_of_birth,height_m,bmi
0,Bella,Labrador,Brown,56,24,2013-07-01,0.56,76.530612
1,Charlie,Poodle,Black,43,24,2016-09-16,0.43,129.799892
2,Lucy,Chow Chow,Brown,46,24,2014-08-25,0.46,113.421550
3,Cooper,Schnauzer,Gray,49,17,2011-12-11,0.49,70.803832
4,Max,Labrador,Black,59,29,2017-01-20,0.59,83.309394
5,Stella,Chihuahua,Tan,18,2,2015-04-20,0.18,61.728395
6,Bernie,St. Bernard,White,77,74,2018-02-27,0.77,124.810255

### Multiple Manipulations - The Real Pandas Power

In [95]:
low_dogs_bmi = dogs_df["bmi"] < 100
bmi_lt_100 = dogs_df[low_dogs_bmi]
bmi_lt_100_height = bmi_lt_100.sort_values("height_cm", ascending=False)
bmi_lt_100_height[["name", "height_cm", "bmi"]]

     name  height_cm        bmi
4     Max         59  83.309394
0   Bella         56  76.530612
3  Cooper         49  70.803832
5  Stella         18  61.728395